SubratShrestha/Neural-Stimulator-Firmware/old/NS-STM32/Core/Src/main.c
}

/* USER CODE BEGIN 4 */
static void Param_Init(void){

	InitQueue(&COMMAND_QUEUE);

	PHASE_ONE_TIME = 10;// default 10us
	PHASE_TWO_TIME = 10;// default 10us
	STIM_AMP = 2000;// default 0uA
	INTER_PHASE_GAP = 10;//default 0us
	INTER_STIM_DELAY = 10;//default 0us
	ANODIC_CATHODIC = 1;//default cathodic
	STIM_TYPE = 0;//default uniform stim
	PULSE_NUM = 0;//default 0 is forever in ms
	BURST_NUM = 0;// number of burst
	INTER_BURST_DELAY = 100;
	PULSE_NUM_IN_ONE_BURST = 10;
	RAMP_UP = 0;
	SHORT_ELECTRODE = 1;
	ELEC_OFFSET = 4;
	//BYPASS_CAP = 0;

	for(int i = 0; i < 75; i++){
		ADC_BUFFER[0].data[i] = 0;
		ADC_BUFFER[1].data[i] = 0;
	}

	ENABLE_RECORD = 0;
	RECORD_FREQ = 2000;
	RECORD_START_OFFSET = 0;
	RECORD_END_OFFSET = 0;

	DAC_PHASE_ONE = 12767;
	DAC_PHASE_TWO = 52767; // 16 bits DAC8831
	DAC_GAP = 32767;

	if(ANODIC_CATHODIC){
		DAC_PHASE_ONE_COMP = DAC_PHASE_ONE + 110;
		DAC_PHASE_TWO_COMP = DAC_PHASE_TWO - 110;
	}else{
		DAC_PHASE_ONE_COMP = DAC_PHASE_ONE - 110;
		DAC_PHASE_TWO_COMP = DAC_PHASE_TWO + 110;
	}
	TEMP_DAC_PHASE_ONE = DAC_PHASE_ONE;
	TEMP_DAC_PHASE_TWO = DAC_PHASE_TWO;
	TEMP_DAC_GAP = DAC_GAP;
	TEMP_PULSE_NUM = PULSE_NUM;
	TEMP_PULSE_NUM_IN_BURST = PULSE_NUM_IN_ONE_BURST;
	TEMP_BURST_NUM = BURST_NUM;

	STIM_MODE = STIM_MODE_UNI_CONT;
	STIM_STATUS = 0;
	PULSE_PROBE = 0;

	// init timer value(-2us is delay compensation)
	/*PHASE_ONE_TIMER = 4 * (PHASE_ONE_TIME-2);
	PHASE_TWO_TIMER = 4 * (PHASE_TWO_TIME-2);
	if(INTER_PHASE_GAP > 2){
		PHASE_GAP_TIMER = 4 * (INTER_PHASE_GAP-2);
	}else{
		PHASE_GAP_TIMER = 4 * INTER_PHASE_GAP;
	}

	if(INTER_STIM_DELAY > 2){
		STIM_DELAY_TIMER = 4 * (INTER_STIM_DELAY - 2);
	}else{
		STIM_DELAY_TIMER = 4 * INTER_STIM_DELAY;
	}
	BURST_DELAY_TIMER = 4 * (INTER_BURST_DELAY - 2);*/

	PHASE_ONE_TIMER = 4 * PHASE_ONE_TIME;
	PHASE_TWO_TIMER = 4 * PHASE_TWO_TIME;
	PHASE_GAP_TIMER = 4 * INTER_PHASE_GAP;
	STIM_DELAY_TIMER = 4 * INTER_STIM_DELAY;
	BURST_DELAY_TIMER = 4 * INTER_BURST_DELAY;
}

static void Reset_Device( void )
{
#if ( CFG_HW_RESET_BY_FW == 1 )
	Reset_BackupDomain();

	Reset_IPCC();
#endif

	return;
}

static void Reset_IPCC( void )
{
	LL_AHB3_GRP1_EnableClock(LL_AHB3_GRP1_PERIPH_IPCC);

	LL_C1_IPCC_ClearFlag_CHx(
			IPCC,
			LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 | LL_IPCC_CHANNEL_4
			| LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	LL_C2_IPCC_ClearFlag_CHx(
			IPCC,
			LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 | LL_IPCC_CHANNEL_4
			| LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	LL_C1_IPCC_DisableTransmitChannel(
			IPCC,
			LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 | LL_IPCC_CHANNEL_4
			| LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	LL_C2_IPCC_DisableTransmitChannel(
			IPCC,
			LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 | LL_IPCC_CHANNEL_4
			| LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	LL_C1_IPCC_DisableReceiveChannel(
			IPCC,
			LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 | LL_IPCC_CHANNEL_4
			| LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	LL_C2_IPCC_DisableReceiveChannel(
			IPCC,
			LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 | LL_IPCC_CHANNEL_4
			| LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	return;
}

static void Reset_BackupDomain( void )
{
	if ((LL_RCC_IsActiveFlag_PINRST() != FALSE) && (LL_RCC_IsActiveFlag_SFTRST() == FALSE))
	{
		HAL_PWR_EnableBkUpAccess(); /**< Enable access to the RTC registers */

		/**
		 *  Write twice the value to flush the APB-AHB bridge
		 *  This bit shall be written in the register before writing the next one
		 */
		HAL_PWR_EnableBkUpAccess();

		__HAL_RCC_BACKUPRESET_FORCE();
		__HAL_RCC_BACKUPRESET_RELEASE();
	}

	return;
}

static void Init_Exti( void )
{
  /**< Disable all wakeup interrupt on CPU1  except IPCC(36), HSEM(38) */
  LL_EXTI_DisableIT_0_31(~0);
  LL_EXTI_DisableIT_32_63( (~0) & (~(LL_EXTI_LINE_36 | LL_EXTI_LINE_38)) );

  return;
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
